In [14]:
# PANDAS DATAFRAME

In [15]:
import pandas as pd
#https://gist.github.com/netj/8836201
iris = pd.read_clipboard()

In [16]:
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [8]:
print(iris.shape)

(150, 5)

In [9]:
print(iris.columns)

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [10]:
iris['variety'].value_counts()

Setosa        50
Versicolor    50
Virginica     50
Name: variety, dtype: int64

In [17]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [18]:
iris.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [19]:
iris.iloc[50:60]

    sepal.length  sepal.width  petal.length  petal.width     variety
50           7.0          3.2           4.7          1.4  Versicolor
51           6.4          3.2           4.5          1.5  Versicolor
52           6.9          3.1           4.9          1.5  Versicolor
53           5.5          2.3           4.0          1.3  Versicolor
54           6.5          2.8           4.6          1.5  Versicolor
55           5.7          2.8           4.5          1.3  Versicolor
56           6.3          3.3           4.7          1.6  Versicolor
57           4.9          2.4           3.3          1.0  Versicolor
58           6.6          2.9           4.6          1.3  Versicolor
59           5.2          2.7           3.9          1.4  Versicolor

In [20]:
iris['sepal.length'].max()

7.9

In [21]:
iris.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [32]:
iris.isna().sum()

sepal.length    0
sepal.width     0
petal.length    0
petal.width     0
variety         0
dtype: int64

## Groupby

In [28]:
grouped_iris = iris.groupby(['variety']).agg(mean_sepal_length = ('sepal.length','mean'))

In [29]:
grouped_iris

            mean_sepal_length
variety
Setosa                  5.006
Versicolor              5.936
Virginica               6.588

In [31]:
iris.groupby('variety')['sepal.length'].mean()

variety
Setosa        5.006
Versicolor    5.936
Virginica     6.588
Name: sepal.length, dtype: float64

## Dataframe join

In [33]:
df1 = iris.head(5)
df2 = iris.tail(5)

In [42]:
df1.reset_index(inplace=True)
df2.reset_index(inplace=True)

In [75]:
df1.set_index('variety',inplace=True)

In [76]:
df1

         index  sepal.length  sepal.width  petal.length  petal.width
variety
Setosa       0           5.1          3.5           1.4          0.2
Setosa       1           4.9          3.0           1.4          0.2
Setosa       2           4.7          3.2           1.3          0.2
Setosa       3           4.6          3.1           1.5          0.2
Setosa       4           5.0          3.6           1.4          0.2

In [77]:
df1.loc['Setosa'] #index wise fetch

         index  sepal.length  sepal.width  petal.length  petal.width
variety
Setosa       0           5.1          3.5           1.4          0.2
Setosa       1           4.9          3.0           1.4          0.2
Setosa       2           4.7          3.2           1.3          0.2
Setosa       3           4.6          3.1           1.5          0.2
Setosa       4           5.0          3.6           1.4          0.2

In [78]:
df1.iloc[3] #3rd rows value

index           3.0
sepal.length    4.6
sepal.width     3.1
petal.length    1.5
petal.width     0.2
Name: Setosa, dtype: float64

In [72]:
df1.iloc[3,2] #3rd rows ,2nd column value

3.1

In [44]:
df_joined = df1.merge(df2,on='index',how='left',
    suffixes=('_first_df', '_second_df'))

In [46]:
df_joined.shape

(5, 11)

## Concat

In [62]:
india_weather = pd.DataFrame({"city":['mumbai','delhi','bangalore'] ,
                              "temperature":[32,45,30],
                              "humidity":[80,60,78]})

us_weather = pd.DataFrame({"city":['newyork','chicago','orlando'] ,
                              "temperature":[21,14,35],
                              "humidity":[68,65,75]})
concatted = pd.concat([india_weather,us_weather],axis=0)

In [63]:
concatted

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0    newyork           21        68
1    chicago           14        65
2    orlando           35        75

In [64]:
concatted.sort_values('temperature',ascending=False)

        city  temperature  humidity
1      delhi           45        60
2    orlando           35        75
0     mumbai           32        80
2  bangalore           30        78
0    newyork           21        68
1    chicago           14        65

In [67]:
concatted[~(concatted['city'].isin(['delhi','bangalore']))]

      city  temperature  humidity
0   mumbai           32        80
0  newyork           21        68
1  chicago           14        65
2  orlando           35        75